PerformanceTests/OLD/Test.yml
---
execution:
- concurrency: 5
  hold-for: 1m
  ramp-up: 10s
  scenario: happy

scenarios:
  happy:
    requests:
      - url: 'http://localhost:8080/index.php'
        method: GET
      - url: 'http://localhost:8080/shipping.php'
        method: POST
        think-time: 1000ms
        body:
          Dist: Amazon
          Price: '10.00'
          ProductName: Testers Pocketbook
          Size: Small
      - url: 'http://localhost:8080/delivery.php'
        method: POST
        think-time: 31935ms
        body:
          Adr1Correct: 'true'
          Adr1Empty: 'false'
          Adr1Valid: 'true'
          Adr2Correct: 'null'
          Adr2Empty: 'true'
          Adr2Valid: 'true'
          ConfirmEmail: will@ca.com
          CountryEmpty: 'false'
          CountryValid: 'true'
          CountyCorrect: 'null'
          CountyEmpty: 'null'
          CountyValid: 'true'
          EarlyFinish: 'false'
          Email: will@ca.com
          EmailEmpty: 'null'
          EmailValid: 'true'
          EmailsDontMatch: 'null'
          NameCorrect: 'null'
          NameEmpty: 'null'
          NameValid: 'true'
          PostCodeCorrect: 'null'
          PostCodeEmpty: 'null'
          PostCodeValid: 'true'
          country: England
          county: London
          line1: 1 main streeet
          line2: ''
          name: will
          post_code: SL3 9LL
      - url: 'http://localhost:8080/payment_details.php'
        method: POST
        think-time: 2848ms
      - url: 'http://localhost:8080/finalise.php'
        method: POST
        think-time: 6946ms
        body:
          EarlyFinish: 'false'
          cardCharge: '2'
          cardNo: '1234123412341234'
          cardNumberValid: 'true'
          cardType: MasterCard (£2.00 Charge)
          cardValid: 'true'